VonKarmanVortexStreet/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.001;

writeControl    timeStep;

writeInterval   100;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{


	vorticity1
	{
	    // Mandatory entries (unmodifiable)
	    type        vorticity;
	    libs        ("libfieldFunctionObjects.so");
	    enabled         true;
	    log             true;
	    executeControl  timeStep;
	    executeInterval 1;
	    writeControl    writeTime; //timeStep;
	    //writeInterval   1;
	}

	planeSample
	{
	    type surfaces;
	    libs (sampling);
	    interpolationScheme cellPoint;
	    writeControl timeStep;
	    outputInterval 1;
	    surfaceFormat raw;
	    fields (U p vorticity);
	    surfaces
	    (
		plane1
		{
			type cuttingPlane;
			planeType pointAndNormal;
			pointAndNormalDict
			{
	 			point (0 0 0.00025);
				normal (0 0 1);
			}
			interpolate true;
		}
	    );

	}

}




// ************************************************************************* //
